# Chapter 7. Data Cleaning and Preparation 
During the course of doing data analysis and modeling, a significant amount of time is spent on data preparation: loading, cleaning, transforming, and rearranging. Sometimes the way that data is stored in files or databases is not in the right format for a particular task. pandas allows you to manipulate data into the right form. In this chapter, we explore the tools for missing data, duplicate data, string manipulation, and some other analytical data transformations. In the next chapter, we will learn how to combine and rearrange datasets in various ways. 
## 7.1. Handling Missing Data 
All of the descriptive statistics on pandas objects exclude missing data by default.

In [8]:
import pandas as pd 
import numpy as np
float_data = pd.Series ([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [9]:
# The isna method gives us a Boolean Series with True where values are null
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [10]:
# The built-in Python None value is also treated as Na
float_data1 = pd.Series ([1.2,-3.5,None,0])
float_data1

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [11]:
float_data1.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [12]:
float_data3 = pd.Series ([1,2,None])
float_data3

0    1.0
1    2.0
2    NaN
dtype: float64

In [13]:
dataframe = pd.DataFrame ({
    "c1": [np.nan, 1, 2],
    "c2": [3,2,4]
},
   index = ["r1","r2","r3"] )
dataframe

     c1  c2
r1  NaN   3
r2  1.0   2
r3  2.0   4

In [14]:
dataframe.dropna(axis ="columns") # drop the rows or columns that contain missing data

    c2
r1   3
r2   2
r3   4

## Filtering Out Missing Data

In [15]:
data = pd.DataFrame ([[1.,5.6,3.],[1,np.nan, np.nan], [np.nan,np.nan,np.nan],[np.nan,6.5,4.]])
data

     0    1    2
0  1.0  5.6  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  4.0

In [16]:
data.dropna ()

     0    1    2
0  1.0  5.6  3.0

In [17]:
# Passing how ="all" will drop only rows that are all NA
data.dropna (how = "all")

     0    1    2
0  1.0  5.6  3.0
1  1.0  NaN  NaN
3  NaN  6.5  4.0

In [18]:
data [4] =np.nan 
data

     0    1    2   4
0  1.0  5.6  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  4.0 NaN

In [19]:
data.dropna (axis="columns", how = "all")

     0    1    2
0  1.0  5.6  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  4.0

In [20]:
# Suppose you want to keep only rows containing at most a certain number of missing observations. You can indicate this with the thresh argument 
df = pd.DataFrame (np.random.standard_normal ((7,3)))
df.iloc [:4,1] =np.nan 
df.iloc [:2,2] =np.nan
df

          0         1         2
0 -0.171857       NaN       NaN
1 -0.018760       NaN       NaN
2 -0.308346       NaN  1.099661
3  1.330820       NaN  0.722193
4 -0.353710 -0.072201 -0.778613
5 -0.990230 -1.022059 -0.310833
6 -0.463941 -1.164796  1.914449

In [21]:
df.dropna ()

          0         1         2
4 -0.353710 -0.072201 -0.778613
5 -0.990230 -1.022059 -0.310833
6 -0.463941 -1.164796  1.914449

In [22]:
df.dropna (thresh =2)

          0         1         2
2 -0.308346       NaN  1.099661
3  1.330820       NaN  0.722193
4 -0.353710 -0.072201 -0.778613
5 -0.990230 -1.022059 -0.310833
6 -0.463941 -1.164796  1.914449

In [23]:
df.dropna (axis = "columns", thresh =4) # thresh = n means to drop the column/row unless it has at least n valid entries

          0         2
0 -0.171857       NaN
1 -0.018760       NaN
2 -0.308346  1.099661
3  1.330820  0.722193
4 -0.353710 -0.778613
5 -0.990230 -0.310833
6 -0.463941  1.914449

### Filling in Missing Data

In [24]:
df.fillna (0) # Fill na with value 0

          0         1         2
0 -0.171857  0.000000  0.000000
1 -0.018760  0.000000  0.000000
2 -0.308346  0.000000  1.099661
3  1.330820  0.000000  0.722193
4 -0.353710 -0.072201 -0.778613
5 -0.990230 -1.022059 -0.310833
6 -0.463941 -1.164796  1.914449

In [25]:
df.fillna ({1:0.5, 2:0}) # Calling fillna with a dictionary, you can use a different fill value for each column

          0         1         2
0 -0.171857  0.500000  0.000000
1 -0.018760  0.500000  0.000000
2 -0.308346  0.500000  1.099661
3  1.330820  0.500000  0.722193
4 -0.353710 -0.072201 -0.778613
5 -0.990230 -1.022059 -0.310833
6 -0.463941 -1.164796  1.914449

In [26]:
# The same inerpolation methods available for reindexing can be used with fillna 
df = pd.DataFrame (np.random.standard_normal ((6,3)))
df.iloc [2:, 1] = np.nan 
df.iloc [4:, 2] = np.nan

df

          0         1         2
0 -0.547975  0.181364  1.089881
1  0.117398 -1.662047 -0.710450
2 -0.274858       NaN  2.272528
3 -0.533058       NaN -0.154349
4  0.406345       NaN       NaN
5 -0.213985       NaN       NaN

In [27]:
df.ffill()
 # It fills each NaN value with the last known (non-null) value above it in the same column, ffill stands for fill forward

          0         1         2
0 -0.547975  0.181364  1.089881
1  0.117398 -1.662047 -0.710450
2 -0.274858 -1.662047  2.272528
3 -0.533058 -1.662047 -0.154349
4  0.406345 -1.662047 -0.154349
5 -0.213985 -1.662047 -0.154349

In [28]:
df.ffill(limit =2) # limit =2 means "Only fill forward the first 2 NaN values in a row â€” leave the rest as-is."

          0         1         2
0 -0.547975  0.181364  1.089881
1  0.117398 -1.662047 -0.710450
2 -0.274858 -1.662047  2.272528
3 -0.533058 -1.662047 -0.154349
4  0.406345       NaN -0.154349
5 -0.213985       NaN -0.154349

In [29]:
data = pd.Series ([1, np.nan, 3.5, np.nan, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2. Data Transformation
### Removing Duplicates

In [30]:
data = pd.DataFrame ({"k1": ["one","two"]*3+ ["two"],
                     "k2": [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
# The DataFrame method duplicated returns a Boolean Series indicating whether each row is a duplicate (its column values are exactly equal to those in an earlier row)
data.duplicated ()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [32]:
data.drop_duplicates ()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
data ["v1"]= np.arange (7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [34]:
data.drop_duplicates (subset = ["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [35]:
# duplicated and drop_duplicates by default keep the first observed value combination. 
data.drop_duplicates (["k1","k2"],keep = "last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transfoming Data Using a Function or Mapping 
For many datasets, you may wish to perform some transformation based on the values in an array, Series, or column in a DataFrame.

In [36]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [37]:
# define a function 
meat_to_animal = {
    "bacon": "pig",
    "pulled pork" : "pig",
    "pastrami": "cow",
    "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [38]:
data ["animal"] = data["food"].map (meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [39]:
# We could alos have passed a function that does all the work 
def get_animal (x):
    return meat_to_animal [x]

data ["food"].map(get_animal)
# Use map is a conventional way to perform element-wise transformation and other data cleaning-related operations.

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [40]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [41]:
data.replace (-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [42]:
data.replace ([-999,-1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [43]:
data.replace ([-999,-1000], [np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [44]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [45]:
def transform (x):
    return x[:4].upper ()
data.index.map (transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [46]:
data.index = data.index.map (transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [47]:
# If you want to create a transformed version of a dataset without modifying the original, use rename
data.rename (index = str.title, columns = str.upper )

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

### Discretization and Binning 
Continuous data is often discretized or otherwise separated into "bins" for analysis. Suppose you have data about a group of people in a study, and you want to group them into discrete age buckets:

In [48]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18,25,35,60,100]
age_categories = pd.cut (ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [49]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [50]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [51]:
pd.Series(age_categories).value_counts ()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

### Detecting and Filtering Outliers
Filtering or transforming outliers is largely a matter of applying array operations. Consider a DataFrame with some normally distributed data.

In [52]:
data = pd.DataFrame (np.random.standard_normal ((1000,4)))
data.describe ()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.032430    -0.000731     0.019596     0.033364
std       1.015146     1.035581     1.002073     0.953895
min      -3.513099    -3.001346    -3.075320    -2.636803
25%      -0.702420    -0.698994    -0.684461    -0.645463
50%      -0.019516    -0.017190     0.020401     0.059852
75%       0.637743     0.700038     0.698229     0.695206
max       3.592558     4.012477     3.531715     3.720128

In [53]:
# Suppose you want to find values in one of the columns exceeding 3 in absolute value 
col = data [2]
col [col.abs()>3]

196   -3.075320
446    3.531715
574    3.059084
642    3.312007
Name: 2, dtype: float64

In [54]:
# To select all rows having a value exceeding 3 or -3, you can use the any method on a Boolean DataFrame
data [(data.abs ()>3).any (axis = "columns")]

            0         1         2         3
185 -1.612875  3.023657  0.717258 -0.814816
196 -0.117615 -0.361224 -3.075320 -0.007112
201  0.108309  3.574718  0.547336  1.604527
208 -3.513099 -1.357382  0.565040 -1.137599
233  0.476258  3.322508 -1.334444  0.436225
261  3.592558 -2.111430  0.951326  0.246372
265  0.396305  3.988346  1.332320 -1.191876
321 -1.010537  4.012477  1.259659  0.049427
446  0.549907  0.325846  3.531715 -0.378508
574  0.061509 -0.456759  3.059084 -0.140353
596 -0.506055  3.215935  1.364535  1.232159
642  0.942720  0.409950  3.312007 -0.556104
676 -3.171267 -1.336115 -0.308628  2.075839
703  1.323629  0.701517 -2.362875  3.720128
956 -2.768602 -3.001346 -0.639780  1.906123

In [55]:
data [data.abs ()>3] = np.sign (data)*3 # The statement np.sign(data) produces 1 and -1 values based on whether the values in data are postive or negative
data.head ()

          0         1         2         3
0 -1.538234  0.294388 -2.129779 -1.208651
1  0.445974  0.932072 -0.652849 -1.081939
2  0.143676 -0.108268 -0.053073 -0.537229
3 -0.015142  0.339583  0.727840 -1.454249
4  1.384740 -0.971380 -0.835965 -1.486552

In [56]:
np.sign (data).head ()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0  1.0 -1.0 -1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

### Permutation and Random Sampling 
Permuting a Series or the rows of a DataFrame is possible using the numpy.random.permutation function

In [57]:
df = pd.DataFrame (np.arange (5*7).reshape ((5,7)))
sampler = np.random.permutation(5)
sampler

array([1, 3, 2, 4, 0])

In [58]:
df.take (sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [59]:
df.reindex (index = sampler)

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [60]:
column_sampler = np.random.permutation (7)
df.take (column_sampler, axis = "columns")

    5   3   4   1   2   0   6
0   5   3   4   1   2   0   6
1  12  10  11   8   9   7  13
2  19  17  18  15  16  14  20
3  26  24  25  22  23  21  27
4  33  31  32  29  30  28  34

In [61]:
# To select a random subst without replacement, you can use the sample method on Series and DataFrame
df.sample (n=3)

    0   1   2   3   4   5   6
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13

In [62]:
# To generate a sample with replacement, pass replace = True
choices = pd.Series ([5,7,-1,6,4])
choices.sample (n=10, replace = True )

0    5
2   -1
2   -1
0    5
2   -1
1    7
3    6
4    4
1    7
2   -1
dtype: int64

### Computing Indiator/ Dummy Variables 
Another type of transformation for statistical modeling or machine learning applications is converting a categorical variable into a dummy or indicator matrix.

In [63]:
df = pd.DataFrame ({"key": ["b", "b","a","c","a","b"],
                   "detal": range (6)})
df

  key  detal
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [64]:
pd.get_dummies (df["key"])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [65]:
pd.get_dummies(df["key"]).astype (int)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

## String Manipulation 
### Python Built-In String Object Methods

In [66]:
val = "a,b,  guido"
val.split (",")

['a', 'b', '  guido']

In [67]:
# split is often combined with strip to trim whitespace 
pieces = [x.strip () for x in val.split (",")]
pieces

['a', 'b', 'guido']

In [68]:
# These substrings could be concatenated together with a two-colon delimiter using addition: 
first, second, third, = pieces 
first+ "::"+ second+ "::" +third

'a::b::guido'

In [69]:
" ".join (pieces)

'a b guido'

### Regular Expressions 
The re module functions fall into three categories: pattern matching, substition, and splitting. Let's look at a simple example: suppose we wanted to split a string with a variable number of whitespace characters.

In [70]:
import re
text = "foo   bar\t baz  \tqux"
re.split (r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [71]:
# If, instead, you want to get a list of all patterns matching teh regex, you can use the findall method 
regex = re.compile (r"\s+")
regex.split (text)
regex.findall (text)

['   ', '\t ', '  \t']

Creating a regex object with re.compile is highly recommended if you want to apply the same expression to many strings;

### String Functions in pandas

In [77]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [76]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [74]:
data.str.contains ("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [75]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

## Categorical Data 
### Background and Motivation

In [78]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [79]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [81]:
pd.Series(values).value_counts ()

apple     6
orange    2
Name: count, dtype: int64

In [82]:
# dimension tables
values = pd.Series ([0,1,0,0]*2)
dim = pd.Series (["apple","orange"])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [83]:
dim

0     apple
1    orange
dtype: object

In [84]:
dim.take (values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

This representation as integers is called the categorical or dictionary-encoded representation. The array of distinct values can be called the categories, dictionary, or levels of the data. The integer values that reference the categories are called the category codes or simply coded.